d = {" ":'0', "е":'e', "т":'t', "и":'i', "н":'n', "а":'a', "м":'m', "с":'s',
"д":'d', "р":'r', "г":'g', "у":'u',
"к":'k', "в":'w', "о":'o', "х":'h', "б":'b', "л":'l', "з":'z', "ф":'f',
"ц":'c', "п":'p', "й":'j', "щ":'q', "ж":'v', "ь":'x', "ы":'y', "ю":'1',
"э":'2', "ъ":'3', "ч":'4', "ш":'5', "я":'6'};


t = 's.txt'
f = open(t)
s = f.read(5)
s2 = ''

for i in range(5):
    a = d[s[i]]
    s2 += a
string = 'readyFiles\\' + s2 + '.txt'
s3 = f.read()
f.close()
g = open(string, 'w')
g.write(s + ' ' + s3)
g.close()

